[
  {"comment": "Microsoft Corporation announces major investment in renewable energy infrastructure to support data centers.", "date": "2025-01-15"},
  {"comment": "Apple Inc. faces criticism over new privacy policies that may impact small developers significantly.", "date": "2025-01-16"},
  {"comment": "Tesla Motors reports record quarterly profits exceeding market expectations for electric vehicle sales.", "date": "2025-01-17"},
  {"comment": "Google LLC launches new AI healthcare initiative to improve diagnostic accuracy in rural hospitals.", "date": "2025-01-18"},
  {"comment": "Amazon Corporation workers express concerns about workplace safety conditions in distribution centers.", "date": "2025-01-19"},
  {"comment": "The new healthcare reform bill receives strong support from medical professionals and patient advocacy groups.", "date": "2025-01-20"},
  {"comment": "Environmental activists oppose the proposed industrial expansion due to potential climate impact concerns.", "date": "2025-01-21"},
  {"comment": "Financial experts warn about increasing inflation rates affecting low-income families disproportionately.", "date": "2025-01-22"},
  {"comment": "Education sector leaders praise the government's investment in digital learning technologies for schools.", "date": "2025-01-23"},
  {"comment": "Netflix Inc. announces partnership with local content creators to promote cultural diversity in media.", "date": "2025-01-24"},
  {"comment": "Citizens express mixed opinions about the new data protection regulations impact on social media platforms.", "date": "2025-01-25"},
  {"comment": "IBM Corporation develops innovative blockchain solutions for government transparency and accountability.", "date": "2025-01-26"},
  {"comment": "Public transportation improvements receive overwhelming support from urban residents and commuter associations.", "date": "2025-01-27"},
  {"comment": "Meta Platforms faces regulatory scrutiny over content moderation policies and user safety measures.", "date": "2025-01-28"},
  {"comment": "Healthcare workers demand better working conditions and fair compensation after pandemic experiences.", "date": "2025-01-29"},
  {"comment": "Oracle Corporation invests heavily in cybersecurity infrastructure to protect client data integrity.", "date": "2025-01-30"},
  {"comment": "The proposed tax reforms generate heated debate among business leaders and economic policy experts.", "date": "2025-01-31"},
  {"comment": "Samsung Electronics launches sustainable manufacturing initiative to reduce carbon footprint significantly.", "date": "2025-02-01"},
  {"comment": "Citizens worry about housing affordability crisis affecting young families in metropolitan areas.", "date": "2025-02-02"},
  {"comment": "Intel Corporation collaborates with universities to advance semiconductor research and development programs.", "date": "2025-02-03"}
]
